SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/CHIPCryptoPALPsaEfr32.cpp
/*
 *
 *    Copyright (c) 2022-2023 Project CHIP Authors
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

/**
 *    @file
 *      PSA Crypto API based implementation of CHIP crypto primitives
 */

#include <crypto/CHIPCryptoPALPSA.h>
#include <crypto/CHIPCryptoPALmbedTLS.h>

#include <lib/core/CHIPEncoding.h>
#include <lib/core/CHIPSafeCasts.h>
#include <lib/support/BufferWriter.h>
#include <lib/support/BytesToHex.h>
#include <lib/support/CodeUtils.h>
#include <lib/support/SafeInt.h>
#include <lib/support/SafePointerCast.h>
#include <lib/support/logging/CHIPLogging.h>

#include <psa/crypto.h>

#include <mbedtls/bignum.h>
#include <mbedtls/ecp.h>
#include <mbedtls/error.h>
#include <mbedtls/x509_csr.h>

#include <cinttypes>
#include <string.h>
#include <type_traits>

// Includes needed for certificate parsing
#if defined(MBEDTLS_X509_CRT_PARSE_C)
#include <mbedtls/x509_crt.h>
#endif // defined(MBEDTLS_X509_CRT_PARSE_C)
#include <mbedtls/md.h>
#include <mbedtls/x509.h>
#include <mbedtls/x509_csr.h>

#if defined(MBEDTLS_ERROR_C)
#include <mbedtls/error.h>
#endif // defined(MBEDTLS_ERROR_C)

namespace chip {
namespace Crypto {

namespace {

bool IsBufferNonEmpty(const uint8_t * data, size_t data_length)
{
    return data != nullptr && data_length > 0;
}

bool IsValidTag(const uint8_t * tag, size_t tag_length)
{
    return tag != nullptr && (tag_length == 8 || tag_length == 12 || tag_length == 16);
}

/**
 * @brief Compare two times
 *
 * @param t1 First time to compare
 * @param t2 Second time to compare
 * @return int  0 If both times are idential to the second, -1 if t1 < t2, 1 if t1 > t2.
 */
int TimeCompare(mbedtls_x509_time * t1, mbedtls_x509_time * t2)
{
    VerifyOrReturnValue(t1->year >= t2->year, -1);
    VerifyOrReturnValue(t1->year <= t2->year, 1);
    // Same year
    VerifyOrReturnValue(t1->mon >= t2->mon, -1);
    VerifyOrReturnValue(t1->mon <= t2->mon, 1);
    // Same month
    VerifyOrReturnValue(t1->day >= t2->day, -1);
    VerifyOrReturnValue(t1->day <= t2->day, 1);
    // Same day
    VerifyOrReturnValue(t1->hour >= t2->hour, -1);
    VerifyOrReturnValue(t1->hour <= t2->hour, 1);
    // Same hour
    VerifyOrReturnValue(t1->min >= t2->min, -1);
    VerifyOrReturnValue(t1->min <= t2->min, 1);
    // Same minute
    VerifyOrReturnValue(t1->sec >= t2->sec, -1);
    VerifyOrReturnValue(t1->sec <= t2->sec, 1);
    // Same second
    return 0;
}

inline unsigned long PsaLogPtr(const void * ptr)
{
    return static_cast<unsigned long>(reinterpret_cast<uintptr_t>(ptr));
}

inline uint32_t PsaLogAlg(psa_algorithm_t alg)
{
    return static_cast<uint32_t>(alg);
}

inline uint32_t PsaLogKeyId(psa_key_id_t keyId)
{
    return static_cast<uint32_t>(keyId);
}

// Use %lu with PsaLogSize(); embedded newlib may not support %lu in ChipLog.
inline unsigned long PsaLogSize(size_t size)
{
    return static_cast<unsigned long>(size);
}

} // namespace

CHIP_ERROR AES_CCM_encrypt(const uint8_t * plaintext, size_t plaintext_length, const uint8_t * aad, size_t aad_length,
                           const Aes128KeyHandle & key, const uint8_t * nonce, size_t nonce_length, uint8_t * ciphertext,
                           uint8_t * tag, size_t tag_length)
{
    VerifyOrReturnError(IsBufferNonEmpty(nonce, nonce_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(IsValidTag(tag, tag_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError((ciphertext != nullptr && plaintext != nullptr) || plaintext_length == 0, CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(aad != nullptr || aad_length == 0, CHIP_ERROR_INVALID_ARGUMENT);

    const psa_algorithm_t algorithm = PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, tag_length);
    psa_aead_operation_t operation  = PSA_AEAD_OPERATION_INIT;
    psa_status_t status             = PSA_SUCCESS;
    size_t out_length               = 0;
    size_t tag_out_length           = 0;

    status = psa_aead_encrypt_setup(&operation, key.As<psa_key_id_t>(), algorithm);
    ChipLogDetail(Crypto,
                  "AES_CCM_encrypt: psa_aead_encrypt_setup(operation=0x%lx, keyId=%" PRIu32 ", algorithm=0x%08" PRIx32
                  ") -> status=%" PRId32,
                  PsaLogPtr(&operation), PsaLogKeyId(key.As<psa_key_id_t>()), PsaLogAlg(algorithm), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_aead_encrypt_setup failed: %" PRId32, status));

    status = psa_aead_set_lengths(&operation, aad_length, plaintext_length);
    ChipLogDetail(Crypto,
                  "AES_CCM_encrypt: psa_aead_set_lengths(operation=0x%lx, ad_length=%lu, plaintext_length=%lu) -> status=%" PRId32,
                  PsaLogPtr(&operation), PsaLogSize(aad_length), PsaLogSize(plaintext_length), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_aead_set_lengths failed: %" PRId32, status));

    status = psa_aead_set_nonce(&operation, nonce, nonce_length);
    ChipLogDetail(Crypto, "AES_CCM_encrypt: psa_aead_set_nonce(operation=0x%lx, nonce=0x%lx, nonce_length=%lu) -> status=%" PRId32,
                  PsaLogPtr(&operation), PsaLogPtr(nonce), PsaLogSize(nonce_length), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_aead_set_nonce failed: %" PRId32, status));

    if (0 == aad_length)
    {
        ChipLogDetail(Crypto, "AES_CCM_encrypt: Using aad == null path");
    }
    else
    {
        status = psa_aead_update_ad(&operation, aad, aad_length);
        ChipLogDetail(Crypto,
                      "AES_CCM_encrypt: psa_aead_update_ad(operation=0x%lx, input=0x%lx, input_length=%lu) -> status=%" PRId32,
                      PsaLogPtr(&operation), PsaLogPtr(aad), PsaLogSize(aad_length), static_cast<int32_t>(status));
        VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "psa_aead_update_ad failed: %" PRId32, status));
    }

    if (0 == plaintext_length)
    {
        // Empty plaintext
        status = psa_aead_finish(&operation, nullptr, 0, &out_length, tag, tag_length, &tag_out_length);
        ChipLogDetail(Crypto,
                      "AES_CCM_encrypt: psa_aead_finish(operation=0x%lx, ciphertext=0x0, ciphertext_size=0, "
                      "ciphertext_length=0x%lx, tag=0x%lx, tag_size=%lu, tag_length=0x%lx) -> status=%" PRId32,
                      PsaLogPtr(&operation), PsaLogPtr(&out_length), PsaLogPtr(tag), PsaLogSize(tag_length),
                      PsaLogPtr(&tag_out_length), static_cast<int32_t>(status));
    }
    else
    {
        // psa_aead_update() requires use of the macro PSA_AEAD_UPDATE_OUTPUT_SIZE to determine the output buffer size.
        // For AES-CCM, PSA_AEAD_UPDATE_OUTPUT_SIZE will round up the size to the next multiple of the block size (16).
        // If the ciphertext length is not a multiple of the block size, we will encrypt in two steps, first with the
        // block_aligned_length, and then with a rounded up partial_block_length, where a temporary buffer will be used for the
        // output.
        constexpr uint8_t kBlockSize = PSA_BLOCK_CIPHER_BLOCK_LENGTH(PSA_KEY_TYPE_AES);
        size_t block_aligned_length  = (plaintext_length / kBlockSize) * kBlockSize;
        size_t partial_block_length  = plaintext_length % kBlockSize;
        size_t ciphertext_length     = 0;
        uint8_t temp[kBlockSize]     = { 0 };

        // Make sure the calculated block_aligned_length is compliant with PSA's output size requirements.
        VerifyOrReturnError(block_aligned_length == PSA_AEAD_UPDATE_OUTPUT_SIZE(PSA_KEY_TYPE_AES, algorithm, block_aligned_length),
                            CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "block_aligned_length is not compliant with PSA's output size requirements"));

        // Add the aligned part of the plaintext
        status = psa_aead_update(&operation, plaintext, block_aligned_length, ciphertext, block_aligned_length, &out_length);
        ChipLogDetail(Crypto,
                      "AES_CCM_encrypt: psa_aead_update(operation=0x%lx, input=0x%lx, input_length=%lu, output=0x%lx, "
                      "output_size=%lu, output_length=0x%lx) -> status=%" PRId32,
                      PsaLogPtr(&operation), PsaLogPtr(plaintext), PsaLogSize(block_aligned_length), PsaLogPtr(ciphertext),
                      PsaLogSize(block_aligned_length), PsaLogPtr(&out_length), static_cast<int32_t>(status));
        VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "psa_aead_update failed: %" PRId32, status));
        VerifyOrReturnError(
            out_length <= block_aligned_length, CHIP_ERROR_INTERNAL,
            ChipLogError(Crypto, "psa_aead_update out_length is not compliant with PSA's output size requirements"));
        ciphertext_length += out_length;

