SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/CHIPCryptoPALPsaEfr32.cpp
        if (partial_block_length > 0)
        {
            // The update output should fit in the temp buffer
            size_t max_output = PSA_AEAD_UPDATE_OUTPUT_SIZE(PSA_KEY_TYPE_AES, algorithm, partial_block_length);
            VerifyOrReturnError(max_output <= sizeof(temp), CHIP_ERROR_INTERNAL,
                                ChipLogError(Crypto, "psa_aead_update output is too large"));

            // Add the non-aligned end of the plaintext
            status =
                psa_aead_update(&operation, &plaintext[block_aligned_length], partial_block_length, temp, max_output, &out_length);
            ChipLogDetail(Crypto,
                          "AES_CCM_encrypt: psa_aead_update(operation=0x%lx, input=0x%lx, input_length=%lu, output=0x%lx, "
                          "output_size=%lu, output_length=0x%lx) -> status=%" PRId32,
                          PsaLogPtr(&operation), PsaLogPtr(&plaintext[block_aligned_length]), PsaLogSize(partial_block_length),
                          PsaLogPtr(temp), PsaLogSize(max_output), PsaLogPtr(&out_length), static_cast<int32_t>(status));
            VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                                ChipLogError(Crypto, "psa_aead_update failed: %" PRId32, status));
            VerifyOrReturnError(
                ciphertext_length + out_length <= plaintext_length, CHIP_ERROR_INTERNAL,
                ChipLogError(Crypto, "psa_aead_update out_length is not compliant with PSA's output size requirements"));
            // Add the encrypted output, if any
            memcpy(&ciphertext[ciphertext_length], temp, out_length);
            ciphertext_length += out_length;
        }

        // The finish output should fit in the temp buffer
        size_t max_finish = PSA_AEAD_FINISH_OUTPUT_SIZE(PSA_KEY_TYPE_AES, algorithm);
        VerifyOrReturnError(max_finish <= sizeof(temp), CHIP_ERROR_BUFFER_TOO_SMALL);

        // The finish may return the last part of the ciphertext
        status = psa_aead_finish(&operation, temp, max_finish, &out_length, tag, tag_length, &tag_out_length);
        ChipLogDetail(Crypto,
                      "AES_CCM_encrypt: psa_aead_finish(operation=0x%lx, ciphertext=0x%lx, ciphertext_size=%lu, "
                      "ciphertext_length=0x%lx, tag=0x%lx, tag_size=%lu, tag_length=0x%lx) -> status=%" PRId32,
                      PsaLogPtr(&operation), PsaLogPtr(temp), PsaLogSize(max_finish), PsaLogPtr(&out_length), PsaLogPtr(tag),
                      PsaLogSize(tag_length), PsaLogPtr(&tag_out_length), static_cast<int32_t>(status));
        VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "psa_aead_finish failed: %" PRId32, status));
        VerifyOrReturnError(
            ciphertext_length + out_length <= plaintext_length, CHIP_ERROR_INTERNAL,
            ChipLogError(Crypto, "psa_aead_finish out_length is not compliant with PSA's output size requirements"));
        // Add the encrypted output, if any
        memcpy(&ciphertext[ciphertext_length], temp, out_length);
        ciphertext_length += out_length;
        VerifyOrReturnError(ciphertext_length == plaintext_length, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "Encrypted ciphertext length does not match plaintext length"));
    }
    VerifyOrReturnError(status == PSA_SUCCESS && tag_length == tag_out_length, CHIP_ERROR_INTERNAL);

    return CHIP_NO_ERROR;
}

CHIP_ERROR AES_CCM_decrypt(const uint8_t * ciphertext, size_t ciphertext_length, const uint8_t * aad, size_t aad_length,
                           const uint8_t * tag, size_t tag_length, const Aes128KeyHandle & key, const uint8_t * nonce,
                           size_t nonce_length, uint8_t * plaintext)
{
    VerifyOrReturnError(IsBufferNonEmpty(nonce, nonce_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(IsValidTag(tag, tag_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError((ciphertext != nullptr && plaintext != nullptr) || ciphertext_length == 0, CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(aad != nullptr || aad_length == 0, CHIP_ERROR_INVALID_ARGUMENT);

    const psa_algorithm_t algorithm = PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, tag_length);
    psa_aead_operation_t operation  = PSA_AEAD_OPERATION_INIT;
    psa_status_t status             = PSA_SUCCESS;
    size_t out_length               = 0;

    status = psa_aead_decrypt_setup(&operation, key.As<psa_key_id_t>(), algorithm);
    ChipLogDetail(
        Crypto, "AES_CCM_decrypt: psa_aead_decrypt_setup(operation=0x%lx, key=%" PRIu32 ", alg=0x%08" PRIx32 ") -> status=%" PRId32,
        PsaLogPtr(&operation), PsaLogKeyId(key.As<psa_key_id_t>()), PsaLogAlg(algorithm), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_aead_decrypt_setup failed: %" PRId32, status));

    status = psa_aead_set_lengths(&operation, aad_length, ciphertext_length);
    ChipLogDetail(Crypto,
                  "AES_CCM_decrypt: psa_aead_set_lengths(operation=0x%lx, ad_length=%lu, plaintext_length=%lu) -> status=%" PRId32,
                  PsaLogPtr(&operation), PsaLogSize(aad_length), PsaLogSize(ciphertext_length), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_aead_set_lengths failed: %" PRId32, status));

    status = psa_aead_set_nonce(&operation, nonce, nonce_length);
    ChipLogDetail(Crypto, "AES_CCM_decrypt: psa_aead_set_nonce(operation=0x%lx, nonce=0x%lx, nonce_length=%lu) -> status=%" PRId32,
                  PsaLogPtr(&operation), PsaLogPtr(nonce), PsaLogSize(nonce_length), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_aead_set_nonce failed: %" PRId32, status));

    if (0 == aad_length)
    {
        ChipLogDetail(Crypto, "AES_CCM_decrypt: Using aad == null path");
    }
    else
    {
        status = psa_aead_update_ad(&operation, aad, aad_length);
        ChipLogDetail(Crypto,
                      "AES_CCM_decrypt: psa_aead_update_ad(operation=0x%lx, input=0x%lx, input_length=%lu) -> status=%" PRId32,
                      PsaLogPtr(&operation), PsaLogPtr(aad), PsaLogSize(aad_length), static_cast<int32_t>(status));
        VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "psa_aead_update_ad failed: %" PRId32, status));
    }

    if (0 == ciphertext_length)
    {
        status = psa_aead_verify(&operation, nullptr, 0, &out_length, tag, tag_length);
        ChipLogDetail(Crypto,
                      "AES_CCM_decrypt: psa_aead_verify(operation=0x%lx, plaintext=0x0, plaintext_size=0, "
                      "plaintext_length=0x%lx, tag=0x%lx, tag_length=%lu) -> status=%" PRId32,
                      PsaLogPtr(&operation), PsaLogPtr(&out_length), PsaLogPtr(tag), PsaLogSize(tag_length),
                      static_cast<int32_t>(status));
    }
    else
    {
        // psa_aead_update() requires use of the macro PSA_AEAD_UPDATE_OUTPUT_SIZE to determine the output buffer size.
        // For AES-CCM, PSA_AEAD_UPDATE_OUTPUT_SIZE will round up the size to the next multiple of the block size (16).
        // If the plaintext length is not a multiple of the block size, we will encrypt in two steps, first with the
        // block_aligned_length, and then with a rounded up partial_block_length, where a temporary buffer will be used for the
        // output.
        constexpr uint8_t kBlockSize = PSA_BLOCK_CIPHER_BLOCK_LENGTH(PSA_KEY_TYPE_AES);
        size_t block_aligned_length  = (ciphertext_length / kBlockSize) * kBlockSize;
        size_t partial_block_length  = ciphertext_length % kBlockSize;
        size_t plaintext_length      = 0;
        uint8_t temp[kBlockSize]     = { 0 };

        // Make sure the calculated block_aligned_length is compliant with PSA's output size requirements.
        VerifyOrReturnError(block_aligned_length == PSA_AEAD_UPDATE_OUTPUT_SIZE(PSA_KEY_TYPE_AES, algorithm, block_aligned_length),
                            CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "block_aligned_length is not compliant with PSA's output size requirements"));

