SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/CHIPCryptoPALPsaEfr32.cpp
        // Add the aligned part of the ciphertext
        status = psa_aead_update(&operation, ciphertext, block_aligned_length, plaintext, block_aligned_length, &out_length);
        ChipLogDetail(Crypto,
                      "AES_CCM_decrypt: psa_aead_update(operation=0x%lx, input=0x%lx, input_length=%lu, output=0x%lx, "
                      "output_size=%lu, output_length=0x%lx) -> status=%" PRId32,
                      PsaLogPtr(&operation), PsaLogPtr(ciphertext), PsaLogSize(block_aligned_length), PsaLogPtr(plaintext),
                      PsaLogSize(block_aligned_length), PsaLogPtr(&out_length), static_cast<int32_t>(status));
        VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "psa_aead_update failed: %" PRId32, status));
        VerifyOrReturnError(
            out_length <= block_aligned_length, CHIP_ERROR_INTERNAL,
            ChipLogError(Crypto, "psa_aead_update out_length is not compliant with PSA's output size requirements"));
        plaintext_length += out_length;

        if (partial_block_length > 0)
        {
            // The update output should fit in the temp buffer
            size_t max_output = PSA_AEAD_UPDATE_OUTPUT_SIZE(PSA_KEY_TYPE_AES, algorithm, partial_block_length);
            VerifyOrReturnError(max_output <= sizeof(temp), CHIP_ERROR_INTERNAL,
                                ChipLogError(Crypto, "psa_aead_update output is too large"));

            // Add the non-aligned end of the ciphertext
            status =
                psa_aead_update(&operation, &ciphertext[block_aligned_length], partial_block_length, temp, max_output, &out_length);
            ChipLogDetail(Crypto,
                          "AES_CCM_decrypt: psa_aead_update(operation=0x%lx, input=0x%lx, input_length=%lu, output=0x%lx, "
                          "output_size=%lu, output_length=0x%lx) -> status=%" PRId32,
                          PsaLogPtr(&operation), PsaLogPtr(&ciphertext[block_aligned_length]), PsaLogSize(partial_block_length),
                          PsaLogPtr(temp), PsaLogSize(max_output), PsaLogPtr(&out_length), static_cast<int32_t>(status));
            VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                                ChipLogError(Crypto, "psa_aead_update failed: %" PRId32, status));
            VerifyOrReturnError(
                plaintext_length + out_length <= ciphertext_length, CHIP_ERROR_INTERNAL,
                ChipLogError(Crypto, "psa_aead_update out_length is not compliant with PSA's output size requirements"));
            // Add the decrypted output, if any
            memcpy(&plaintext[plaintext_length], temp, out_length);
            plaintext_length += out_length;
        }

        // The finish output should fit in the temp buffer
        size_t max_verify = PSA_AEAD_VERIFY_OUTPUT_SIZE(PSA_KEY_TYPE_AES, algorithm);
        VerifyOrReturnError(max_verify <= sizeof(temp), CHIP_ERROR_BUFFER_TOO_SMALL);

        // Complete verification
        status = psa_aead_verify(&operation, temp, max_verify, &out_length, tag, tag_length);
        ChipLogDetail(Crypto,
                      "AES_CCM_decrypt: psa_aead_verify(operation=0x%lx, plaintext=0x%lx, plaintext_size=%lu, "
                      "plaintext_length=0x%lx, tag=0x%lx, tag_length=%lu) -> status=%" PRId32,
                      PsaLogPtr(&operation), PsaLogPtr(temp), PsaLogSize(max_verify), PsaLogPtr(&out_length), PsaLogPtr(tag),
                      PsaLogSize(tag_length), static_cast<int32_t>(status));
        VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "psa_aead_verify failed: %" PRId32, status));
        VerifyOrReturnError(
            plaintext_length + out_length <= ciphertext_length, CHIP_ERROR_INTERNAL,
            ChipLogError(Crypto, "psa_aead_verify out_length is not compliant with PSA's output size requirements"));
        // Add the decrypted output, if any
        memcpy(&plaintext[plaintext_length], temp, out_length);
        plaintext_length += out_length;
        VerifyOrReturnError(ciphertext_length == plaintext_length, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "Decrypted plaintext length does not match ciphertext length"));
    }
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL);

    return CHIP_NO_ERROR;
}

CHIP_ERROR Hash_SHA256(const uint8_t * data, const size_t data_length, uint8_t * out_buffer)
{
    size_t outLength = 0;

    const psa_status_t status =
        psa_hash_compute(PSA_ALG_SHA_256, data, data_length, out_buffer, PSA_HASH_LENGTH(PSA_ALG_SHA_256), &outLength);
    ChipLogDetail(Crypto,
                  "Hash_SHA256: psa_hash_compute(alg=0x%08" PRIx32 ", input=0x%lx, input_length=%lu, hash=0x%lx, hash_size=%lu, "
                  "hash_length=0x%lx) -> status=%" PRId32,
                  PsaLogAlg(PSA_ALG_SHA_256), PsaLogPtr(data), PsaLogSize(data_length), PsaLogPtr(out_buffer),
                  PsaLogSize(PSA_HASH_LENGTH(PSA_ALG_SHA_256)), PsaLogPtr(&outLength), static_cast<int32_t>(status));

    return status == PSA_SUCCESS ? CHIP_NO_ERROR : CHIP_ERROR_INTERNAL;
}

CHIP_ERROR Hash_SHA1(const uint8_t * data, const size_t data_length, uint8_t * out_buffer)
{
    size_t outLength = 0;

    const psa_status_t status =
        psa_hash_compute(PSA_ALG_SHA_1, data, data_length, out_buffer, PSA_HASH_LENGTH(PSA_ALG_SHA_1), &outLength);
    ChipLogDetail(Crypto,
                  "Hash_SHA1: psa_hash_compute(alg=0x%08" PRIx32 ", input=0x%lx, input_length=%lu, hash=0x%lx, hash_size=%lu, "
                  "hash_length=0x%lx) -> status=%" PRId32,
                  PsaLogAlg(PSA_ALG_SHA_1), PsaLogPtr(data), PsaLogSize(data_length), PsaLogPtr(out_buffer),
                  PsaLogSize(PSA_HASH_LENGTH(PSA_ALG_SHA_1)), PsaLogPtr(&outLength), static_cast<int32_t>(status));

    return status == PSA_SUCCESS ? CHIP_NO_ERROR : CHIP_ERROR_INTERNAL;
}

static inline psa_hash_operation_t * toHashOperation(HashSHA256OpaqueContext * context)
{
    return SafePointerCast<psa_hash_operation_t *>(context);
}

static inline psa_hash_operation_t & toHashOperation(HashSHA256OpaqueContext & context)
{
    return *SafePointerCast<psa_hash_operation_t *>(&context);
}

