SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/CHIPCryptoPALPsaEfr32.cpp
Hash_SHA256_stream::Hash_SHA256_stream()
{
    toHashOperation(mContext) = PSA_HASH_OPERATION_INIT;
}

Hash_SHA256_stream::~Hash_SHA256_stream()
{
    Clear();
}

CHIP_ERROR Hash_SHA256_stream::Begin()
{
    toHashOperation(mContext) = PSA_HASH_OPERATION_INIT;
    const psa_status_t status = psa_hash_setup(toHashOperation(&mContext), PSA_ALG_SHA_256);
    ChipLogDetail(Crypto, "Hash_SHA256_stream::Begin: psa_hash_setup(operation=0x%lx, alg=0x%08" PRIx32 ") -> status=%" PRId32,
                  PsaLogPtr(toHashOperation(&mContext)), PsaLogAlg(PSA_ALG_SHA_256), static_cast<int32_t>(status));

    return status == PSA_SUCCESS ? CHIP_NO_ERROR : CHIP_ERROR_INTERNAL;
}

CHIP_ERROR Hash_SHA256_stream::AddData(const ByteSpan data)
{
    uint8_t * ptr = nullptr;
    ptr           = (uint8_t *) malloc(data.size());
    if (ptr == nullptr)
    {
        return CHIP_ERROR_NO_MEMORY;
    }
    memcpy(ptr, data.data(), data.size());

    const psa_status_t status = psa_hash_update(toHashOperation(&mContext), ptr, data.size());
    ChipLogDetail(Crypto,
                  "Hash_SHA256_stream::AddData: psa_hash_update(operation=0x%lx, input=0x%lx, input_length=%lu) -> status=%" PRId32,
                  PsaLogPtr(toHashOperation(&mContext)), PsaLogPtr(ptr), PsaLogSize(data.size()), static_cast<int32_t>(status));
    ChipLogByteSpan(Crypto, ByteSpan(ptr, data.size()));
    free(ptr);
    return status == PSA_SUCCESS ? CHIP_NO_ERROR : CHIP_ERROR_INTERNAL;
}

CHIP_ERROR Hash_SHA256_stream::GetDigest(MutableByteSpan & out_buffer)
{
    VerifyOrReturnError(out_buffer.size() >= PSA_HASH_LENGTH(PSA_ALG_SHA_256), CHIP_ERROR_BUFFER_TOO_SMALL);

    CHIP_ERROR error               = CHIP_NO_ERROR;
    psa_status_t status            = PSA_SUCCESS;
    psa_hash_operation_t operation = PSA_HASH_OPERATION_INIT;
    size_t outLength;

    status = psa_hash_clone(toHashOperation(&mContext), &operation);
    ChipLogDetail(
        Crypto, "Hash_SHA256_stream::GetDigest: psa_hash_clone(source_operation=0x%lx, target_operation=0x%lx) -> status=%" PRId32,
        PsaLogPtr(toHashOperation(&mContext)), PsaLogPtr(&operation), static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

    status = psa_hash_finish(&operation, out_buffer.data(), out_buffer.size(), &outLength);
    ChipLogDetail(Crypto,
                  "Hash_SHA256_stream::GetDigest: psa_hash_finish(operation=0x%lx, hash=0x%lx, hash_size=%lu, hash_length=0x%lx) "
                  "-> status=%" PRId32,
                  PsaLogPtr(&operation), PsaLogPtr(out_buffer.data()), PsaLogSize(out_buffer.size()), PsaLogPtr(&outLength),
                  static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);
    out_buffer.reduce_size(outLength);

exit:
    psa_hash_abort(&operation);

    return error;
}

CHIP_ERROR Hash_SHA256_stream::Finish(MutableByteSpan & out_buffer)
{
    VerifyOrReturnError(out_buffer.size() >= PSA_HASH_LENGTH(PSA_ALG_SHA_256), CHIP_ERROR_BUFFER_TOO_SMALL);

    size_t outLength;

    const psa_status_t status = psa_hash_finish(toHashOperation(&mContext), out_buffer.data(), out_buffer.size(), &outLength);
    ChipLogDetail(Crypto,
                  "Hash_SHA256_stream::Finish: psa_hash_finish(operation=0x%lx, hash=0x%lx, hash_size=%lu, hash_length=0x%lx) -> "
                  "status=%" PRId32,
                  PsaLogPtr(toHashOperation(&mContext)), PsaLogPtr(out_buffer.data()), PsaLogSize(out_buffer.size()),
                  PsaLogPtr(&outLength), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_hash_finish failed: %" PRId32, status));
    ChipLogByteSpan(Crypto, ByteSpan(out_buffer.data(), outLength));
    out_buffer.reduce_size(outLength);

    return CHIP_NO_ERROR;
}

void Hash_SHA256_stream::Clear()
{
    psa_hash_abort(toHashOperation(&mContext));
}

CHIP_ERROR FindFreeKeySlotInRange(psa_key_id_t & keyId, psa_key_id_t start, uint32_t range)
{
    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_key_id_t end                = start + range;

    VerifyOrReturnError(start >= PSA_KEY_ID_USER_MIN && end - 1 <= PSA_KEY_ID_USER_MAX, CHIP_ERROR_INVALID_ARGUMENT);

    for (keyId = start; keyId < end; keyId++)
    {
        psa_status_t status = psa_get_key_attributes(keyId, &attributes);
        ChipLogDetail(Crypto,
                      "FindFreeKeySlotInRange: psa_get_key_attributes(key=%" PRIu32 ", attributes=0x%lx) -> status=%" PRId32,
                      PsaLogKeyId(keyId), PsaLogPtr(&attributes), static_cast<int32_t>(status));
        if (status == PSA_ERROR_INVALID_HANDLE)
        {
            return CHIP_NO_ERROR;
        }
        else if (status != PSA_SUCCESS)
        {
            ChipLogError(Crypto, "psa_get_key_attributes failed: %" PRId32, status);
            return CHIP_ERROR_INTERNAL;
        }
    }
    return CHIP_ERROR_NOT_FOUND;
}

CHIP_ERROR PsaKdf::Init(const ByteSpan & secret, const ByteSpan & salt, const ByteSpan & info)
{
    psa_status_t status        = PSA_SUCCESS;
    psa_key_attributes_t attrs = PSA_KEY_ATTRIBUTES_INIT;

    psa_set_key_type(&attrs, PSA_KEY_TYPE_DERIVE);
    psa_set_key_algorithm(&attrs, PSA_ALG_HKDF(PSA_ALG_SHA_256));
    psa_set_key_usage_flags(&attrs, PSA_KEY_USAGE_DERIVE);

    status = psa_import_key(&attrs, secret.data(), secret.size(), &mSecretKeyId);
    ChipLogDetail(Crypto,
                  "PsaKdf::Init: psa_import_key(attributes=0x%lx, data=0x%lx, data_length=%lu, key=0x%lx) -> status=%" PRId32,
                  PsaLogPtr(&attrs), PsaLogPtr(secret.data()), PsaLogSize(secret.size()), PsaLogPtr(&mSecretKeyId),
                  static_cast<int32_t>(status));
    LogPsaError(status);
    psa_reset_key_attributes(&attrs);
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_import_key failed: %" PRId32, status));

    return InitOperation(mSecretKeyId, salt, info);
}

