SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/CHIPCryptoPALPsaEfr32.cpp
CHIP_ERROR PsaKdf::Init(const HkdfKeyHandle & hkdfKey, const ByteSpan & salt, const ByteSpan & info)
{
    return InitOperation(hkdfKey.As<psa_key_id_t>(), salt, info);
}

CHIP_ERROR PsaKdf::InitOperation(psa_key_id_t hkdfKey, const ByteSpan & salt, const ByteSpan & info)
{
    psa_status_t status = psa_key_derivation_setup(&mOperation, PSA_ALG_HKDF(PSA_ALG_SHA_256));
    ChipLogDetail(Crypto,
                  "PsaKdf::InitOperation: psa_key_derivation_setup(operation=0x%lx, alg=0x%08" PRIx32 ") -> status=%" PRId32,
                  PsaLogPtr(&mOperation), PsaLogAlg(PSA_ALG_HKDF(PSA_ALG_SHA_256)), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_key_derivation_setup failed: %" PRId32, status));

    if (salt.size() > 0)
    {
        status = psa_key_derivation_input_bytes(&mOperation, PSA_KEY_DERIVATION_INPUT_SALT, salt.data(), salt.size());
        ChipLogDetail(Crypto,
                      "PsaKdf::InitOperation: psa_key_derivation_input_bytes(operation=0x%lx, step=%d, data=0x%lx, "
                      "data_length=%lu) -> status=%" PRId32,
                      PsaLogPtr(&mOperation), static_cast<int>(PSA_KEY_DERIVATION_INPUT_SALT), PsaLogPtr(salt.data()),
                      PsaLogSize(salt.size()), static_cast<int32_t>(status));
        VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                            ChipLogError(Crypto, "psa_key_derivation_input_bytes failed: %" PRId32, status));
    }

    status = psa_key_derivation_input_key(&mOperation, PSA_KEY_DERIVATION_INPUT_SECRET, hkdfKey);
    ChipLogDetail(
        Crypto, "PsaKdf::InitOperation: psa_key_derivation_input_key(operation=0x%lx, step=%d, key=%" PRIu32 ") -> status=%" PRId32,
        PsaLogPtr(&mOperation), static_cast<int>(PSA_KEY_DERIVATION_INPUT_SECRET), PsaLogKeyId(hkdfKey),
        static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_key_derivation_input_key failed: %" PRId32, status));

    status = psa_key_derivation_input_bytes(&mOperation, PSA_KEY_DERIVATION_INPUT_INFO, info.data(), info.size());
    ChipLogDetail(Crypto,
                  "PsaKdf::InitOperation: psa_key_derivation_input_bytes(operation=0x%lx, step=%d, data=0x%lx, data_length=%lu) "
                  "-> status=%" PRId32,
                  PsaLogPtr(&mOperation), static_cast<int>(PSA_KEY_DERIVATION_INPUT_INFO), PsaLogPtr(info.data()),
                  PsaLogSize(info.size()), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_key_derivation_input_bytes failed: %" PRId32, status));

    return CHIP_NO_ERROR;
}

void LogPsaError(psa_status_t status)
{
    if (status != PSA_SUCCESS)
    {
        ChipLogError(Crypto, "PSA error: %d", static_cast<int>(status));
    }
}

CHIP_ERROR PsaKdf::DeriveBytes(const MutableByteSpan & output)
{
    psa_status_t status = psa_key_derivation_output_bytes(&mOperation, output.data(), output.size());
    ChipLogDetail(
        Crypto,
        "PsaKdf::DeriveBytes: psa_key_derivation_output_bytes(operation=0x%lx, output=0x%lx, output_length=%lu) -> status=%" PRId32,
        PsaLogPtr(&mOperation), PsaLogPtr(output.data()), PsaLogSize(output.size()), static_cast<int32_t>(status));
    LogPsaError(status);
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL);

    return CHIP_NO_ERROR;
}

CHIP_ERROR PsaKdf::DeriveKey(const psa_key_attributes_t & attributes, psa_key_id_t & keyId)
{
    psa_status_t status = psa_key_derivation_output_key(&attributes, &mOperation, &keyId);
    ChipLogDetail(
        Crypto, "PsaKdf::DeriveKey: psa_key_derivation_output_key(attributes=0x%lx, operation=0x%lx, key=0x%lx) -> status=%" PRId32,
        PsaLogPtr(&attributes), PsaLogPtr(&mOperation), PsaLogPtr(&keyId), static_cast<int32_t>(status));
    LogPsaError(status);
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL);

    return CHIP_NO_ERROR;
}

CHIP_ERROR HKDF_sha::HKDF_SHA256(const uint8_t * secret, const size_t secret_length, const uint8_t * salt, const size_t salt_length,
                                 const uint8_t * info, const size_t info_length, uint8_t * out_buffer, size_t out_length)
{
    VerifyOrReturnError(IsBufferNonEmpty(secret, secret_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(IsBufferNonEmpty(info, info_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(IsBufferNonEmpty(out_buffer, out_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(salt != nullptr || salt_length == 0, CHIP_ERROR_INVALID_ARGUMENT);
    ChipLogDetail(Crypto, "HKDF_sha::HKDF_SHA256: secret=%p secret_length=%ld", secret, static_cast<long>(secret_length));
    ChipLogByteSpan(Crypto, ByteSpan(secret, secret_length));
    ChipLogDetail(Crypto, "HKDF_sha::HKDF_SHA256: salt=%p salt_length=%ld", salt, static_cast<long>(salt_length));
    ChipLogByteSpan(Crypto, ByteSpan(salt, salt_length));
    ChipLogDetail(Crypto, "HKDF_sha::HKDF_SHA256: info=%p info_length=%ld", info, static_cast<long>(info_length));
    ChipLogByteSpan(Crypto, ByteSpan(info, info_length));
    ChipLogDetail(Crypto, "HKDF_sha::HKDF_SHA256: out_buffer=%p out_length=%ld", out_buffer, static_cast<long>(out_length));
    ChipLogByteSpan(Crypto, ByteSpan(out_buffer, out_length));
    PsaKdf kdf;

    ReturnErrorOnFailure(kdf.Init(ByteSpan(secret, secret_length), ByteSpan(salt, salt_length), ByteSpan(info, info_length)));

    return kdf.DeriveBytes(MutableByteSpan(out_buffer, out_length));
}

CHIP_ERROR HMAC_sha::HMAC_SHA256(const uint8_t * key, size_t key_length, const uint8_t * message, size_t message_length,
                                 uint8_t * out_buffer, size_t out_length)
{
    VerifyOrReturnError(IsBufferNonEmpty(key, key_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(IsBufferNonEmpty(message, message_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(out_buffer != nullptr && out_length == PSA_HASH_LENGTH(PSA_ALG_SHA_256), CHIP_ERROR_INVALID_ARGUMENT);

