SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/CHIPCryptoPALPsaEfr32.cpp
    const psa_algorithm_t algorithm = PSA_ALG_HMAC(PSA_ALG_SHA_256);
    CHIP_ERROR error                = CHIP_NO_ERROR;
    psa_status_t status             = PSA_SUCCESS;
    psa_key_attributes_t attrs      = PSA_KEY_ATTRIBUTES_INIT;
    psa_key_id_t keyId              = 0;

    psa_set_key_type(&attrs, PSA_KEY_TYPE_HMAC);
    psa_set_key_algorithm(&attrs, algorithm);
    psa_set_key_usage_flags(&attrs, PSA_KEY_USAGE_SIGN_HASH);

    status = psa_import_key(&attrs, key, key_length, &keyId);
    ChipLogDetail(
        Crypto,
        "HMAC_sha::HMAC_SHA256: psa_import_key(attributes=0x%lx, data=0x%lx, data_length=%lu, key=0x%lx) -> status=%" PRId32,
        PsaLogPtr(&attrs), PsaLogPtr(key), PsaLogSize(key_length), PsaLogPtr(&keyId), static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

    status = psa_mac_compute(keyId, algorithm, message, message_length, out_buffer, out_length, &out_length);
    ChipLogDetail(Crypto,
                  "HMAC_sha::HMAC_SHA256: psa_mac_compute(key=%" PRIu32 ", alg=0x%08" PRIx32
                  ", input=0x%lx, input_length=%lu, mac=0x%lx, mac_size=%lu, mac_length=0x%lx) -> status=%" PRId32,
                  PsaLogKeyId(keyId), PsaLogAlg(algorithm), PsaLogPtr(message), PsaLogSize(message_length), PsaLogPtr(out_buffer),
                  PsaLogSize(out_length), PsaLogPtr(&out_length), static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

    ChipLogDetail(Crypto, "HMAC_SHA256(raw key): key=%p key_length=%ld", key, static_cast<long>(key_length));
    ChipLogByteSpan(Crypto, ByteSpan(key, key_length));
    ChipLogDetail(Crypto, "HMAC_SHA256(raw key): message=%p message_length=%ld", message, static_cast<long>(message_length));
    ChipLogByteSpan(Crypto, ByteSpan(message, message_length));
    ChipLogDetail(Crypto, "HMAC_SHA256(raw key): out_buffer=%p out_length=%ld", out_buffer, static_cast<long>(out_length));
    ChipLogByteSpan(Crypto, ByteSpan(out_buffer, out_length));

exit:
    LogPsaError(status);
    psa_destroy_key(keyId);
    psa_reset_key_attributes(&attrs);

    return CHIP_NO_ERROR;
}

CHIP_ERROR HMAC_sha::HMAC_SHA256(const Hmac128KeyHandle & key, const uint8_t * message, size_t message_length, uint8_t * out_buffer,
                                 size_t out_length)
{
    VerifyOrReturnError(IsBufferNonEmpty(message, message_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(out_buffer != nullptr && out_length == PSA_HASH_LENGTH(PSA_ALG_SHA_256), CHIP_ERROR_INVALID_ARGUMENT);

    const psa_algorithm_t algorithm = PSA_ALG_HMAC(PSA_ALG_SHA_256);
    psa_status_t status             = PSA_SUCCESS;

    status = psa_mac_compute(key.As<psa_key_id_t>(), algorithm, message, message_length, out_buffer, out_length, &out_length);
    ChipLogDetail(Crypto,
                  "HMAC_sha::HMAC_SHA256: psa_mac_compute(key=%" PRIu32 ", alg=0x%08" PRIx32
                  ", input=0x%lx, input_length=%lu, mac=0x%lx, mac_size=%lu, mac_length=0x%lx) -> status=%" PRId32,
                  PsaLogKeyId(key.As<psa_key_id_t>()), PsaLogAlg(algorithm), PsaLogPtr(message), PsaLogSize(message_length),
                  PsaLogPtr(out_buffer), PsaLogSize(out_length), PsaLogPtr(&out_length), static_cast<int32_t>(status));
    VerifyOrReturnError(status == PSA_SUCCESS, CHIP_ERROR_INTERNAL,
                        ChipLogError(Crypto, "psa_mac_compute failed: %" PRId32, status));

    ChipLogDetail(Crypto, "HMAC_SHA256(key handle): key_id=%" PRIu32, PsaLogKeyId(key.As<psa_key_id_t>()));
    ChipLogDetail(Crypto, "HMAC_SHA256(key handle): message=%p message_length=%ld", message, static_cast<long>(message_length));
    ChipLogByteSpan(Crypto, ByteSpan(message, message_length));
    ChipLogDetail(Crypto, "HMAC_SHA256(key handle): out_buffer=%p out_length=%ld", out_buffer, static_cast<long>(out_length));
    ChipLogByteSpan(Crypto, ByteSpan(out_buffer, out_length));
    return CHIP_NO_ERROR;
}

CHIP_ERROR PBKDF2_sha256::pbkdf2_sha256(const uint8_t * pass, size_t pass_length, const uint8_t * salt, size_t salt_length,
                                        unsigned int iteration_count, uint32_t key_length, uint8_t * key)
{
    VerifyOrReturnError(IsBufferNonEmpty(pass, pass_length), CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(key != nullptr, CHIP_ERROR_INVALID_ARGUMENT);
    VerifyOrReturnError(salt_length >= kSpake2p_Min_PBKDF_Salt_Length && salt_length <= kSpake2p_Max_PBKDF_Salt_Length,
                        CHIP_ERROR_INVALID_ARGUMENT);

    CHIP_ERROR error                         = CHIP_NO_ERROR;
    psa_status_t status                      = PSA_SUCCESS;
    psa_key_derivation_operation_t operation = PSA_KEY_DERIVATION_OPERATION_INIT;

    status = psa_key_derivation_setup(&operation, PSA_ALG_PBKDF2_HMAC(PSA_ALG_SHA_256));
    ChipLogDetail(Crypto,
                  "PBKDF2_sha256::pbkdf2_sha256: psa_key_derivation_setup(operation=0x%lx, alg=0x%08" PRIx32 ") -> status=%" PRId32,
                  PsaLogPtr(&operation), PsaLogAlg(PSA_ALG_PBKDF2_HMAC(PSA_ALG_SHA_256)), static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

    status = psa_key_derivation_input_bytes(&operation, PSA_KEY_DERIVATION_INPUT_SALT, salt, salt_length);
    ChipLogDetail(Crypto,
                  "PBKDF2_sha256::pbkdf2_sha256: psa_key_derivation_input_bytes(operation=0x%lx, step=%d, data=0x%lx, "
                  "data_length=%lu) -> status=%" PRId32,
                  PsaLogPtr(&operation), static_cast<int>(PSA_KEY_DERIVATION_INPUT_SALT), PsaLogPtr(salt), PsaLogSize(salt_length),
                  static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

    status = psa_key_derivation_input_integer(&operation, PSA_KEY_DERIVATION_INPUT_COST, iteration_count);
    ChipLogDetail(
        Crypto,
        "PBKDF2_sha256::pbkdf2_sha256: psa_key_derivation_input_integer(operation=0x%lx, step=%d, value=%u) -> status=%" PRId32,
        PsaLogPtr(&operation), static_cast<int>(PSA_KEY_DERIVATION_INPUT_COST), iteration_count, static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

    status = psa_key_derivation_input_bytes(&operation, PSA_KEY_DERIVATION_INPUT_PASSWORD, pass, pass_length);
    ChipLogDetail(Crypto,
                  "PBKDF2_sha256::pbkdf2_sha256: psa_key_derivation_input_bytes(operation=0x%lx, step=%d, data=0x%lx, "
                  "data_length=%lu) -> status=%" PRId32,
                  PsaLogPtr(&operation), static_cast<int>(PSA_KEY_DERIVATION_INPUT_PASSWORD), PsaLogPtr(pass),
                  PsaLogSize(pass_length), static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

