SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/CHIPCryptoPALPsaEfr32.cpp
    status = psa_key_derivation_output_bytes(&operation, key, key_length);
    ChipLogDetail(Crypto,
                  "PBKDF2_sha256::pbkdf2_sha256: psa_key_derivation_output_bytes(operation=0x%lx, output=0x%lx, "
                  "output_length=%" PRIu32 ") -> status=%" PRId32,
                  PsaLogPtr(&operation), PsaLogPtr(key), key_length, static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

exit:
    psa_key_derivation_abort(&operation);

    return error;
}

CHIP_ERROR add_entropy_source(entropy_source /* fn_source */, void * /* p_source */, size_t /* threshold */)
{
    return CHIP_ERROR_UNSUPPORTED_CHIP_FEATURE;
}

CHIP_ERROR DRBG_get_bytes(uint8_t * out_buffer, const size_t out_length)
{
    VerifyOrReturnError(IsBufferNonEmpty(out_buffer, out_length), CHIP_ERROR_INVALID_ARGUMENT);

    const psa_status_t status = psa_generate_random(out_buffer, out_length);
    ChipLogDetail(Crypto, "DRBG_get_bytes: psa_generate_random(output=0x%lx, output_size=%lu) -> status=%" PRId32,
                  PsaLogPtr(out_buffer), PsaLogSize(out_length), static_cast<int32_t>(status));

    return status == PSA_SUCCESS ? CHIP_NO_ERROR : CHIP_ERROR_INTERNAL;
}

static int CryptoRNG(void * ctxt, uint8_t * out_buffer, size_t out_length)
{
    return (chip::Crypto::DRBG_get_bytes(out_buffer, out_length) == CHIP_NO_ERROR) ? 0 : 1;
}

/*******************************************************************************
 *
 * WARNING: The default (base) implementation of P256Keypair is UNSAFE!
 *
 * Because of the way CHIPCryptoPAL has evolved, it is dictating how a base
 * P256Keypair should behave. This includes:
 *      * Allowing using a P256 key for both ECDSA and ECDH operations
 *      * Needing to support copying a key through Serialize()/Deserialize()
 *        operations. This can't easily be done opaquely on an opaque backend
 *        without convoluted forms of reference tracking.
 *      * Not including a way to figure out whether the created key is supposed
 *        to be ephemeral or long-lived.
 *      * Needing to support ingestion of specific-format keys through
 *        Deserialize() (to support e.g. the example DAC provider).
 *
 * These conditions have lead to the base implementation of this class in this
 * crypto backend being backed by a plaintext key buffer instead of opaque key
 * references. Usage of the base class is strongly discouraged, and is only
 * implemented to support the in-tree examples which instantiate keys of this
 * base class.
 *
 ******************************************************************************/

CHIP_ERROR P256Keypair::ECDSA_sign_msg(const uint8_t * msg, const size_t msg_length, P256ECDSASignature & out_signature) const
{
    VerifyOrReturnError(mInitialized, CHIP_ERROR_UNINITIALIZED);
    VerifyOrReturnError(IsBufferNonEmpty(msg, msg_length), CHIP_ERROR_INVALID_ARGUMENT);

    CHIP_ERROR error                      = CHIP_NO_ERROR;
    psa_status_t status                   = PSA_SUCCESS;
    size_t outputLen                      = 0;
    const PsaP256KeypairContext & context = ToConstPsaContext(mKeypair);

    status = psa_sign_message(context.key_id, PSA_ALG_ECDSA(PSA_ALG_SHA_256), msg, msg_length, out_signature.Bytes(),
                              out_signature.Capacity(), &outputLen);
    ChipLogDetail(
        Crypto,
        "P256Keypair::ECDSA_sign_msg: psa_sign_message(key=%" PRIu32 ", alg=0x%08" PRIx32
        ", input=0x%lx, input_length=%lu, signature=0x%lx, signature_size=%lu, signature_length=0x%lx) -> status=%" PRId32,
        PsaLogKeyId(context.key_id), PsaLogAlg(PSA_ALG_ECDSA(PSA_ALG_SHA_256)), PsaLogPtr(msg), PsaLogSize(msg_length),
        PsaLogPtr(out_signature.Bytes()), PsaLogSize(out_signature.Capacity()), PsaLogPtr(&outputLen),
        static_cast<int32_t>(status));

    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);
    VerifyOrExit(outputLen == kP256_ECDSA_Signature_Length_Raw, error = CHIP_ERROR_INTERNAL);
    error = out_signature.SetLength(outputLen);

exit:
    LogPsaError(status);
    return error;
}

CHIP_ERROR P256PublicKey::ECDSA_validate_msg_signature(const uint8_t * msg, const size_t msg_length,
                                                       const P256ECDSASignature & signature) const
{
    VerifyOrReturnError(IsBufferNonEmpty(msg, msg_length), CHIP_ERROR_INVALID_ARGUMENT);

    CHIP_ERROR error                = CHIP_NO_ERROR;
    psa_status_t status             = PSA_SUCCESS;
    psa_key_id_t keyId              = 0;
    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;

    psa_set_key_type(&attributes, PSA_KEY_TYPE_ECC_PUBLIC_KEY(PSA_ECC_FAMILY_SECP_R1));
    psa_set_key_algorithm(&attributes, PSA_ALG_ECDSA(PSA_ALG_SHA_256));
    psa_set_key_usage_flags(&attributes, PSA_KEY_USAGE_VERIFY_MESSAGE);

    status = psa_import_key(&attributes, ConstBytes(), Length(), &keyId);
    ChipLogDetail(Crypto,
                  "P256PublicKey::ECDSA_validate_msg_signature: psa_import_key(attributes=0x%lx, data=0x%lx, data_length=%lu, "
                  "key=0x%lx) -> status=%" PRId32,
                  PsaLogPtr(&attributes), PsaLogPtr(ConstBytes()), PsaLogSize(Length()), PsaLogPtr(&keyId),
                  static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INTERNAL);

    status = psa_verify_message(keyId, PSA_ALG_ECDSA(PSA_ALG_SHA_256), msg, msg_length, signature.ConstBytes(), signature.Length());
    ChipLogDetail(Crypto,
                  "P256PublicKey::ECDSA_validate_msg_signature: psa_verify_message(key=%" PRIu32 ", alg=0x%08" PRIx32
                  ", input=0x%lx, input_length=%lu, signature=0x%lx, signature_length=%lu) -> status=%" PRId32,
                  PsaLogKeyId(keyId), PsaLogAlg(PSA_ALG_ECDSA(PSA_ALG_SHA_256)), PsaLogPtr(msg), PsaLogSize(msg_length),
                  PsaLogPtr(signature.ConstBytes()), PsaLogSize(signature.Length()), static_cast<int32_t>(status));
    VerifyOrExit(status == PSA_SUCCESS, error = CHIP_ERROR_INVALID_SIGNATURE);

