SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/CHIPCryptoPALPsaEfr32.cpp
exit:
    _log_mbedTLS_error(result);
    Clear();
    return error;
}

void Spake2p_P256_SHA256_HKDF_HMAC::Clear()
{
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::Clear");
    VerifyOrReturn(state != CHIP_SPAKE2P_STATE::PREINIT);

    Spake2p_Context * context = to_inner_spake2p_context(&mSpake2pContext);
    mbedtls_ecp_point_free(&context->M);
    mbedtls_ecp_point_free(&context->N);
    mbedtls_ecp_point_free(&context->X);
    mbedtls_ecp_point_free(&context->Y);
    mbedtls_ecp_point_free(&context->L);
    mbedtls_ecp_point_free(&context->Z);
    mbedtls_ecp_point_free(&context->V);

    mbedtls_mpi_free(&context->w0);
    mbedtls_mpi_free(&context->w1);
    mbedtls_mpi_free(&context->xy);
    mbedtls_mpi_free(&context->tempbn);

    mbedtls_ecp_group_free(&context->curve);
    state = CHIP_SPAKE2P_STATE::PREINIT;
}

CHIP_ERROR Spake2p_P256_SHA256_HKDF_HMAC::Mac(const uint8_t * key, size_t key_len, const uint8_t * in, size_t in_len,
                                              MutableByteSpan & out_span)
{
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::Mac: key=%p key_len=%ld", key, static_cast<long>(key_len));
    ChipLogByteSpan(Crypto, ByteSpan(key, key_len));
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::Mac: in=%p in_len=%ld", in, static_cast<long>(in_len));
    ChipLogByteSpan(Crypto, ByteSpan(in, in_len));
    HMAC_sha hmac;
    VerifyOrReturnError(out_span.size() >= kSHA256_Hash_Length, CHIP_ERROR_BUFFER_TOO_SMALL);
    ReturnErrorOnFailure(hmac.HMAC_SHA256(key, key_len, in, in_len, out_span.data(), kSHA256_Hash_Length));
    out_span = out_span.SubSpan(0, kSHA256_Hash_Length);
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::Mac: out_span=%p out_span_len=%ld", out_span.data(),
                  static_cast<long>(out_span.size()));
    ChipLogByteSpan(Crypto, ByteSpan(out_span.data(), out_span.size()));
    return CHIP_NO_ERROR;
}

CHIP_ERROR Spake2p_P256_SHA256_HKDF_HMAC::MacVerify(const uint8_t * key, size_t key_len, const uint8_t * mac, size_t mac_len,
                                                    const uint8_t * in, size_t in_len)
{
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::MacVerify: key=%p key_len=%ld", key, static_cast<long>(key_len));
    ChipLogByteSpan(Crypto, ByteSpan(key, key_len));
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::MacVerify: mac=%p mac_len=%ld", mac, static_cast<long>(mac_len));
    ChipLogByteSpan(Crypto, ByteSpan(mac, mac_len));
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::MacVerify: in=%p in_len=%ld", in, static_cast<long>(in_len));
    ChipLogByteSpan(Crypto, ByteSpan(in, in_len));

    CHIP_ERROR error = CHIP_NO_ERROR;
    int result       = 0;

    uint8_t computed_mac[kSHA256_Hash_Length];
    MutableByteSpan computed_mac_span{ computed_mac };
    VerifyOrExit(mac_len == kSHA256_Hash_Length, error = CHIP_ERROR_INVALID_ARGUMENT);

    SuccessOrExit(error = Mac(key, key_len, in, in_len, computed_mac_span));
    VerifyOrExit(computed_mac_span.size() == mac_len, error = CHIP_ERROR_INTERNAL);
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::MacVerify: computed_mac_span=%p computed_mac_span_len=%ld",
                  computed_mac_span.data(), static_cast<long>(computed_mac_span.size()));
    ChipLogByteSpan(Crypto, ByteSpan(computed_mac_span.data(), computed_mac_span.size()));
    VerifyOrExit(IsBufferContentEqualConstantTime(mac, computed_mac, kSHA256_Hash_Length), error = CHIP_ERROR_INTERNAL);

exit:
    _log_mbedTLS_error(result);
    return error;
}

CHIP_ERROR Spake2p_P256_SHA256_HKDF_HMAC::FELoad(const uint8_t * in, size_t in_len, void * fe)
{
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FELoad: in=%p in_len=%ld", in, static_cast<long>(in_len));
    ChipLogByteSpan(Crypto, ByteSpan(in, in_len));
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FELoad: fe=%p", fe);
    CHIP_ERROR error = CHIP_NO_ERROR;
    int result       = 0;

    result = mbedtls_mpi_read_binary((mbedtls_mpi *) fe, Uint8::to_const_uchar(in), in_len);
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FELoad: result=%d", result);
    VerifyOrExit(result == 0, error = CHIP_ERROR_INTERNAL);

    result = mbedtls_mpi_mod_mpi((mbedtls_mpi *) fe, (mbedtls_mpi *) fe, (const mbedtls_mpi *) order);
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FELoad: result=%d", result);
    VerifyOrExit(result == 0, error = CHIP_ERROR_INTERNAL);

exit:
    _log_mbedTLS_error(result);
    return error;
}

CHIP_ERROR Spake2p_P256_SHA256_HKDF_HMAC::FEWrite(const void * fe, uint8_t * out, size_t out_len)
{
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FEWrite: fe=%p out=%p out_len=%ld", fe, out, static_cast<long>(out_len));
    if (mbedtls_mpi_write_binary((const mbedtls_mpi *) fe, Uint8::to_uchar(out), out_len) != 0)
    {
        return CHIP_ERROR_INTERNAL;
    }
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FEWrite: out=%p out_len=%ld", out, static_cast<long>(out_len));
    ChipLogByteSpan(Crypto, ByteSpan(out, out_len));
    return CHIP_NO_ERROR;
}

CHIP_ERROR Spake2p_P256_SHA256_HKDF_HMAC::FEGenerate(void * fe)
{
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FEGenerate");
    CHIP_ERROR error = CHIP_NO_ERROR;
    int result       = 0;

    Spake2p_Context * context = to_inner_spake2p_context(&mSpake2pContext);

    result = mbedtls_ecp_gen_privkey(&context->curve, (mbedtls_mpi *) fe, CryptoRNG, nullptr);
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FEGenerate: result=%d", result);
    VerifyOrExit(result == 0, error = CHIP_ERROR_INTERNAL);

exit:
    _log_mbedTLS_error(result);
    return error;
}

CHIP_ERROR Spake2p_P256_SHA256_HKDF_HMAC::FEMul(void * fer, const void * fe1, const void * fe2)
{
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FEMul: fer=%p fe1=%p fe2=%p", fer, fe1, fe2);
    CHIP_ERROR error = CHIP_NO_ERROR;
    int result       = 0;

    result = mbedtls_mpi_mul_mpi((mbedtls_mpi *) fer, (const mbedtls_mpi *) fe1, (const mbedtls_mpi *) fe2);
    ChipLogDetail(Crypto, "Spake2p_P256_SHA256_HKDF_HMAC::FEMul: result=%d", result);
    VerifyOrExit(result == 0, error = CHIP_ERROR_INTERNAL);

